#ifndef Menu_H
#define Menu_H

#include<iostream>
using namespace std;

class PrintMenu{
    public:
    int MainMenu()//主菜单
    {
        int  n;
	cout << "\t -------------------------------------------------------------------"  << endl;
	cout << "\t|              1.管理员登录                  2.用户登录             |" << endl;
	cout << "\t|              3.用户注册                    4.退出                 |" << endl;
	cout << "\t -------------------------------------------------------------------" << endl;
	cout << "请选择：";
	cin >> n;
	return n;
    }

    int UserMenu()//用户菜单
    {
        int n;
	cout << "\t********************      欢迎用户    ******************************"<< endl;
	cout << endl;
	cout << "\t -------------------------------------------------------------------"<<endl;
	cout << "\t|         1.显示所有图书                 2.搜索借阅图书             |" << endl;
	cout << "\t|         3.退出                                                    |" << endl;
	cout << "\t|                  				  						           |" << endl;
	cout << "\t -------------------------------------------------------------------" << endl;
	cout << "请选择：";
	cin >> n;
	return n;
    }

    int AdminMenu()//管理员菜单
    {
	int n;
	cout << "\t********************    欢迎管理员   ********************************" << endl;
	cout << endl;
	cout << "\t -------------------------------------------------------------------"  << endl;
	cout << "\t|         1.显示所有图书                 2.添加图书                 |" << endl;
	cout << "\t|         3.删除图书                     4.显示所有用户             |" << endl;
	cout << "\t|         5.返回主菜单     										   |" << endl;
	cout << "\t ------------------------------------------------------------------- "  << endl;
	cout << "请选择：";
	cin >> n;
	return n;
}
};

#endif